# ==================================================================
# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |х
number = int(input('Введите трехзначное число:\n '))
sum = 0
if 100 <= number < 1000:
    while number != 0:
        sum += number % 10
        number //= 10
    print(sum)
else:
    print("Введеное число не является трехзначным")
